Autodesk.Revit.DB.AdaptivePointOrientationType
An enumerated type containing possible orientation types for Adaptive Points.
Remarks:
The default orientation of adaptive points is AdaptivePointOrientationType.ToInstance.
All the items of this enumerated type were renamed for Revit 2016
to better align the names with the corresponding text in the Revit UI.
The numeric values of the items weren't modified, allowing existing
applications to work. However, to be able to rebuild an application,
all point orientations need to be changed to their respective new names.
Since:
2012

Autodesk.Revit.DB.AdaptivePointOrientationType.ToInstance
The adaptive point will be oriented to the coordinate system of the adaptive
family instance the point is part of. This is the default orientation of adaptive points.
This option was previously named: FamilyOrthogonal

Autodesk.Revit.DB.AdaptivePointOrientationType.ToInstanceZthenHost
The Z axis of the adaptive point will be oriented to the Z axis of the adaptive family instance
the point is part of. The XY axis are determined by the XY of the geometry the point is hosted on.
This option was previously named: FamilyVertical

Autodesk.Revit.DB.AdaptivePointOrientationType.ToGlobalXYZ
The adaptive point will be oriented to the coordinate system of the document the instance is placed in.
This option was previously named: PlacementOrthogonal

Autodesk.Revit.DB.AdaptivePointOrientationType.ToGlobalZthenHost
The Z axis of the adaptive point will be oriented to the Z axis of the document the instance
is placed in. The XY axis are determined by the XY of the geometry the point is hosted on.
This option was previously named: PlacementVertical.

Autodesk.Revit.DB.AdaptivePointOrientationType.ToHostAndLoopSystem
The adaptive point will be oriented to the coordinate system of the geometry the point is hosted on.
However, the orientation of the Z axis is controlled by the order of placed points. If the placed
adaptive points of a component are placed in a different order with respect to the host order,
(clockwise instead of counter-clockwise), then the Z axis will invert and the planar projection will flip.
This option was previously named: HostReferenceAutoFlip.

Autodesk.Revit.DB.AdaptivePointOrientationType.ToHost
The adaptive point will be oriented to the coordinate system of the geometry the point is hosted on.
This option was previously named: HostReferenceStrictly